sizes = {
   'XXS':{
       'Помойка':42,
       'Германия':36,
       'США':8,
       'Франция':38,
       'Великобритания':24
   },
   'XS':{
       'Помойка':44,
       'Германия':38,
       'США':10,
       'Франция':40,
       'Великобритания':26
   },
   'S':{
       'Помойка':46,
       'Германия':40,
       'США':12,
       'Франция':42,
       'Великобритания':28
   },
   'M':{
       'Помойка':48,
       'Германия':42,
       'США':14,
       'Франция':44,
       'Великобритания':30
   },
   'L':{
       'Помойка':50,
       'Германия':44,
       'США':16,
       'Франция':46,
       'Великобритания':32
   },
   'XL':{
       'Помойка':22,
       'Германия':46,
       'США':18,
       'Франция':48,
       'Великобритания':34
   }
}
def find_rozmir(a,b):
   if a in sizes and b in sizes[a]:
       rozmir = sizes[a][b]
   return rozmir

strana = input("Введите страну ")
rozmir = input("Введите размер ")
print(find_rozmir(rozmir,strana))
